[
  {
    "Title": "Язык программирования C# 6.0 и платформа .NET 4.6",
    "Authors": "Эндрю Троелсен, Филипп Джепикс",
    "Year": 2016,
    "Language": "русский",
    "PageCount": 1440,
    "Description": "Новое 7-е издание этой книги было полностью пересмотрено и переписано с учетом последних изменений спецификации языка C# и новых достижений платформы .NET Framework. Отдельные главы посвящены важным новым средствам, которые делают .NET Framework 4.6 самым передовым выпуском, в том числе: - Усовершенствованная модель программирования ADO.NET Entity Framework; \r\n- Многочисленные улучшения IDE - среды и архитектуры MVVM для разработки настольных приложений WPF;\r\n-Многочисленные обновления в ASP.NET Web API.\r\nПомимо этого предлагается исчерпывающее рассмотрение всех ключевых возможностей языка C#, как старых, так и новых, что позволило обрести популярность предыдущим изданиям этой книги. Читатели получат основательные знания приемов объектно-ориентированной обработки, атрибутов и рефлексии, обобщений и коллекций, а также обретут понимание многих сложных тем, которые не раскрываются в других источниках (таких как коды операций CIL и выпуск динамических сборок).\r\nОсновная миссия книги заключается в том, чтобы служить исчерпывающим руководством по языку программирования C# и ключевым аспектам платформы .NET, а также предоставлять обзорные сведения о технологиях, построенных на основе C# и .NET (ADO.NET и Entity Framework, Windows Communication Foundation (WCF), Windows Presentation Foundation (WPF) и ASP.NET (Web Forms, MVC, Web API)).\r\nБлагодаря приведенной в книге информации у читателей появится возможность применять полученные знания при решении специфичных задач программирования и готовность к дальнейшим исследованиям мира .NET.",
    "Price": 3038.0,
    "Category": {
      "Name": "Языки программирования"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": "Россия"
    },
    "AverageRating": "0"
  },
  {
    "Title": "C# 6.0. Справочник. Полное описание языка",
    "Authors": "Джозеф Албахари, Бен Албахари",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 1040,
    "Description": "Данное руководство, ставшее бестселлером, позволяет получить точные ответы практически на любые вопросы по C# 6.0, CLR и основным сборкам .NET Framework. После своего появления в 2000 году C# стал языком с выдающейся гибкостью и мощью, но его постоянный рост и совершенствование означают необходимость в дополнительном изучении. Организованное по концепциям и сценариям использования, существенно обновленное 6-е издание книги предлагает программистам средней и высокой квалификации лаконичный план получения знаний по языку C# и платформе .NET Framework. Читая ее, вы очень быстро поймете, почему это руководство считают авторитетным справочником по C#.\r\nИзучите все аспекты языка C#, начиная с основ синтаксиса и переменных и заканчивая сложными темами, такими как указатели и перегрузка операций.\r\nНаучитесь пользоваться языком LINQ благодаря трем посвященным ему главам.\r\nОсвойте динамическое, асинхронное и параллельное программирование.\r\nПолучите навыки работы со средствами .NET, в числе которых XML, взаимодействие с сетью, сериализация, рефлексия, безопасность, домены приложений и контракты кода.\r\nИсследуйте новый компилятор как службу C# 6.0 под названием Roslyn. ",
    "Price": 2533.0,
    "BookCover": null,
    "Category": {
      "Name": "Языки программирования"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": "Россия"
    },
    "AverageRating": "0"
  },
  {
    "Title": "C# для профессионалов. Тонкости программирования",
    "Authors": "Джон Скит",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 608,
    "Description": "Книга C# ДЛЯ ПРОФЕССИОНАЛОВ. ТОНКОСТИ ПРОГРАММИРОВАНИЯ (C# in Depth) является обновлением предыдущего издания, ставшего бестселлером, с целью раскрытия новых средств языка C# 5, включая решение проблем, которые связаны с написанием сопровождаемого асинхронного кода. Она предлагает уникальные сведения о сложных областях и темных закоулках языка, которые может предоставить только эксперт Джон Скит. Если вы занимаетесь разработкой приложений .NET, то будете использовать C# как при построении сложного приложения уровня предприятия, так и при ускоренном написании какого-нибудь чернового приложения. В C# 5 можно делать удивительные вещи с помощью обобщений, лямбда-выражений, динамической типизации, LINQ, итераторных блоков и других средств. Однако прежде их необходимо должным образом изучить. Третье издание книги было полностью пересмотрено с целью раскрытия новых средств версии C# 5, включая тонкости написания сопровождаемого асинхронного кода. Вы увидите всю мощь языка C# в действии и научитесь работать с ценнейшими средствами, которые эффективно впишутся в применяемый набор инструментов. Кроме того, вы узнаете, как избегать скрытых ловушек при программировании на C# с помощью кристально чистых объяснений вопросов, касающихся внутреннего устройства языка. В этой книге предполагается, что вы хорошо усвоили свою первую книгу по C# и жаждете большего! Что внутри:\r\nобновления, появившиеся в C# 5;\r\nновое средство async/await;\r\nкак и почему работает C#; Об авторе Джон Скит - старший инженер по программному обеспечению в Google, а также видный участник групп новостей, групп пользователей, международных конференций и сайта Stack Overflow Q&A. Большая часть ежедневной работы Джона связана с кодированием на Java, но его сердце принадлежит C#.",
    "Price": 1920.0,
    "BookCover": null,
    "Category": {
      "Name": "Языки программирования"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": "Россия"
    },
    "AverageRating": "0"
  },
  {
    "Title": "ASP.NET Core MVC с примерами на C# для профессионалов",
    "Authors": "Адам Фримен",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 992,
    "Description": "В книге объясняется, как эффективно применять новые возможности инфраструктуры 'модель - представление - контроллер' (MVC), обновленной до версии ASP.NET Core MVC. Теперь вы сможете создавать более экономные, оптимизированные под облако и готовые к функционированию на мобильных устройствах приложения для платформы .NET. Книга предоставляет детальное описание того, как вписать новую функциональность в существующий контекст разработки. Инфраструктура ASP.NET Core MVC - это самая последняя ступень развития веб-платформы ASP.NET производства Microsoft, построенная на совершенно новом фундаменте. Она олицетворяет коренное изменение в том, как Microsoft конструирует и развертывает инфраструктуры для разработки веб-приложений, и свободна от унаследованных технологий, подобных Web Forms. Платформа ASP.NET Core MVC предлагает 'независимую от хоста' инфраструктуру и высокопродуктивную модель программирования, которая способствует построению более чистой кодовой архитектуры, разработке через тестирование и значительной расширяемости.\r\nНовое 6 - е издание этой лидирующей на рынке книги следует тому же формату и стилю подачи материала,\r\nкоторым отличались популярные предыдущие издания,\r\nно повсеместно обновлено с учетом выпуска ASP.NET Core MVC.Адам Фримен,\r\nавтор многочисленных бестселлеров,\r\nтщательно пересмотрел книгу,\r\nчтобы показать,\r\nкак извлечь максимум из ASP.NET Core MVC.\r\nОн представляет полностью работающий учебный пример функционирующего приложения ASP.NET MVC,\r\nкоторый вы сможете использовать в качестве шаблона для собственных проектов.Вы начнете с азов и постепенно доберетесь до описания более сложных средств.\r\nБлагодаря этой книге,\r\nвы освоите следующие темы:\r\n-Обретете глубокое понимание архитектуры ASP.NET Core MVC\r\n- Изучите инфраструктуру ASP.NET Core MVC как единое целое\r\n- Увидите в действии инфраструктуру MVC и разработку через тестирование\r\n- Узнаете новые возможности ASP.NET Core MVC и научитесь их эффективно применять в своей работе\r\n- Выясните,\r\nкак создавать веб - службы REST и одностраничные приложения(SPA)\r\n- Сможете воспользоваться имеющимися у вас знаниями предшествующих выпусков MVC для быстрого и эффективного освоения новой модели программирования.",
    "Price": 3546.0,
    "BookCover": null,
    "Category": {
      "Name": "Backend"
    },
    "Publisher": {
      "Name": "Диалектика",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "Эффективное программирование на C#. 50 способов улучшения кода",
    "Authors": "Билл Вагнер",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 224,
    "Description": "В этой книге многоуважаемый эксперт в области .NET Билл Вагнер исследует 50 способов использования в своих целях полной мощи языка C# 6.0 для написания исключительно надежного, эффективного и высокопроизводительного кода. Отражая растущую сложность языка C# и сообщества разработчиков, автор обозначает десятки новых путей написания лучшего кода. В число новых решений настоящего издания входят такие, которые задействуют преимущества обобщений, а также те, что более сконцентрированы на LINQ. Отдельная глава посвящена передовому опыту работы с исключениями. Ясное и ориентированное на практику изложение Вагнера, экспертные советы и реалистичный код делают книгу незаменимой для сотен тысяч разработчиков. Опираясь на свой непревзойденный опыт, автор рассматривает все темы, простирающиеся от управления ресурсами до поддержки многоядерных процессоров, и объясняет, каким образом избежать распространенных ловушек в языке и среде .NET. Вы узнаете, как выбирать наиболее эффективное решение, когда существует множество вариантов, и каким образом писать код, который гораздо легче сопровождать и улучшать. \r\n\r\nАвтор книги показывает, как и почему: \r\nотдавать предпочтение неявно типизированным локальным переменным (см. совет 1) \r\nзаменять вызовы string.Format() интерполированными строками (см. совет 4)\r\nвыражать обратные вызовы с помощью делегатов (см. совет 7)\r\nиспользовать наилучшим образом управление ресурсами .NET (см. совет 11)\r\nопределять минимальные и достаточные ограничения для обобщений (см. совет 18)\r\nспециализировать обобщенные алгоритмы с применением контроля типов во время выполнения (см. совет 19)\r\nиспользовать делегаты для определения ограничений методов на параметрах типов (см. совет 23)\r\nдополнять минимальные контракты интерфейсов расширяющими методами (см. совет 27)\r\nсоздавать компонуемые API-интерфейсы для последовательностей (см. совет 31)\r\nотвязывать итерации от действий, предикатов и функций (см. совет 32)\r\nотдавать предпочтение лямбда-выражениям перед методами (см. совет 38)\r\nпроводить различие между ранним и отложенным выполнением (см. совет 40)\r\nизбегать захватывания затратных ресурсов (см. совет 41)\r\nприменять исключения для сообщения о нарушениях контрактов методов (см. совет 45)\r\nзадействовать побочные эффекты в фильтрах исключений (см. совет 50) \r\nВы уже успешный программист на C#, а эта книга сделает вас выдающимся программистом.",
    "Price": 1258.0,
    "BookCover": null,
    "Category": {
      "Name": "Языки программирования"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "WPF: Windows Presentation Foundation в .NET 4.5 с примерами на C# 5.0 для профессионалов",
    "Authors": "Мэтью Макдональд",
    "Year": 2014,
    "Language": "русский",
    "PageCount": 1024,
    "Description": "Книга 'WPF: Windows Presentation Foundation в.NET 4.5 с примерами на C# 5.0 для профессионалов' представляет собой исчерпывающее авторитетное руководство по внутренней работе WPF. Благодаря серьезным примерам и практическим рекомендациям, вы изучите все, что необходимо знать для профессионального использования WPF. Книга начинается с построения прочного фундамента из элементарных концепций, подкрепленного существующими знаниями языка C#. Затем предлагается обсуждение сложных концепций с их демонстрацией на полезных примерах, которые подчеркивают получаемую экономию времени и затраченных усилий Платформа Windows Presentation Foundation (WPF) от Microsoft предоставляет инфраструктуру разработки, предназначенную для построения высококачественных пользовательских интерфейсов для операционной системы Windows. Она сочетает в себе насыщенный контент из широкого диапазона источников и позволяет получить неограниченный доступ ко всей вычислительной мощи компьютера, функционирующего под управлением Windows. В книге 'WPF: Windows Presentation Foundation в .NET 4.5 с примерами на C# 5.0 для профессионалов' подробно рассматриваются следующие темы\r\nФундаментальные основы программирования для WPF,\r\nначиная с XAML и заканчивая элементами управления и потоком данных\r\nРазработка реалистичных приложений,\r\nпозволяющих увидеть навигацию,\r\nлокализацию и развертывание в действии\r\nИсследование расширенных элементов управления пользовательского интерфейса,\r\nкоторые предлагаются WPF\r\nИзучение способов управления документами внутри WPF: компоновка текста,\r\nвывод на печать и упаковка документов\r\nИспользование графики и мультимедиа для совершенствования приложений\r\nКнига рассчитана на разработчиков,\r\nкоторые впервые сталкиваются с WPF.Опыт программирования на C# и знание базовой архитектуры .NET поможет быстрее разобраться с примерами, но все необходимые концепции кратко объясняются с самого начала.",
    "Price": 3200.0,
    "BookCover": null,
    "Category": {
      "Name": "Desktop"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "Angular для профессионалов",
    "Authors": "Адам Фримен",
    "Year": 2018,
    "Language": "русский",
    "PageCount": 800,
    "Description": "Выжмите из Angular - ведущего фреймворка для динамических приложений JavaScript - всё. Адам Фримен начинает с описания MVC и его преимуществ, затем показывает, как эффективно использовать Angular, охватывая все этапы: начиная с основ и до самых передовых возможностей, которые кроются в глубинах этого фреймворка. Каждая тема изложена четко и лаконично, снабжена большим количеством подробностей, которые позволят стать вам действительно эффективными. Наиболее важные фичи даны без излишних подробностей, но содержат всю необходимую информацию, чтобы вы смогли обойти все подводные камни.",
    "Price": 1577.0,
    "BookCover": null,
    "Category": {
      "Name": "Frontend"
    },
    "Publisher": {
      "Name": "Питер",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "Angular и TypeScript. Сайтостроение для профессионалов",
    "Authors": "Яков Файн, Антон Моисеев",
    "Year": 2018,
    "Language": "русский",
    "PageCount": 464,
    "Description": "Если вы занимаетесь веб-разработкой - от веб-клиентов до полнофункциональных одностраничных приложений - то фреймворк Angular будет для вас просто спасением. Этот ультрасовременный инструмент полностью интегрирован со статически типизированным языком TypeScript, который отлично вписывается в экосистему JavaScript.Вы научитесь:\r\nПроектировать и строить модульные приложения.\r\nПравильно транспилировать TypeScript в JavaScript.\r\nПользоваться новейшими инструментами JavaScript - в частности, npm, Karma и Webpack.\r\nЕсли вам знаком язык JavaScript - берите и читайте! Знаний TypeScript или AngularJS для изучения книги не требуется.",
    "Price": 1124.0,
    "BookCover": null,
    "Category": {
      "Name": "Frontend"
    },
    "Publisher": {
      "Name": "Питер",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "React и Redux. Функциональная веб-разработка",
    "Authors": "Алекс Бэнкс, Ева Порселло",
    "Year": 2018,
    "Language": "русский",
    "PageCount": 336,
    "Description": "Хотите научиться писать эффективные пользовательские интерфейсы при помощи React? Тогда вы нашли нужную книгу. Авторы расскажут, как создавать пользовательские интерфейсы при помощи этой компактной библиотеки и писать сайты, на которых можно обрабатывать огромные объемы данных без перезагрузки страниц. Также вы изучите новейшие возможности стандарта ECMAScript и функционального программирования.",
    "Price": 972.0,
    "BookCover": null,
    "Category": {
      "Name": "Frontend"
    },
    "Publisher": {
      "Name": "Питер",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "Microsoft SQL Server 2012. Основы T-SQL",
    "Authors": "Ицик Бен-Ган",
    "Year": 2015,
    "Language": "русский",
    "PageCount": 400,
    "Description": "В книге изложены основы программирования на языке T-SQL. Вы научитесь программировать и писать запросы для Microsoft SQL Server 2012, а большое количество примеров и упражнений помогут вам начать создавать эффективный код.",
    "Price": 902.0,
    "BookCover": null,
    "Category": {
      "Name": "Базы данных"
    },
    "Publisher": {
      "Name": "Эксмо",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "Освой самостоятельно SQL за 10 минут",
    "Authors": "Бен Форта",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 228,
    "Description": "d",
    "Price": 650.0,
    "BookCover": null,
    "Category": {
      "Name": "Базы данных"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "JavaScript и jQuery. Исчерпывающее руководство",
    "Authors": "Дэвид Сойер Макфарланд",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 880,
    "Description": "JavaScript - основной инструмент веб-разработчиков, позволяющий делать интернет-страницы интерактивными. Перед вами - наиболее полное и великолепно структурированное руководство по JavaScript, которое позволит в совершенстве овладеть этим востребованным сейчас языком программирования. В книге уделено большое внимание библиотеке jQuery, в том числе самого современного плагина jQuery UI.",
    "Price": 799.0,
    "BookCover": null,
    "Category": {
      "Name": "Frontend"
    },
    "Publisher": {
      "Name": "Эксмо",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "ES6 и не только",
    "Authors": "Кайл Симпсон",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 336,
    "Description": "Даже если у вас уже есть опыт работы с JavaScript, скорее всего, язык вы в полной мере не знаете. Особое внимание в этой книге уделяется новым функциям, появившимся в Ecmascript 6 (ES6) - последней версии стандарта JavaScript. ES6 повествует о тонкостях языка, малознакомых большинству работающих на JavaScript программистов. Вооружившись этими знаниями, вы достигните подлинного мастерства; выучите новый синтаксис; научитесь корректно использовать итераторы, генераторы, модули и классы; сможете более эффективно работы с данными; познакомитесь с новыми API, например, Array, Object, Math, Number и String; расширите функционал программ с помощью мета-программирования.",
    "Price": 776.0,
    "BookCover": null,
    "Category": {
      "Name": "Frontend"
    },
    "Publisher": {
      "Name": "Питер",
      "Country": null
    },
    "AverageRating": "0"
  },
  {
    "Title": "Изучаем JavaScript. Руководство по созданию современных веб-сайтов",
    "Authors": "Этан Браун",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 368,
    "Description": "Сейчас самое время изучить JavaScript. После выхода последней спецификации JavaScript - ECMAScript 6.0 (ES6) - научиться создавать высококачественные приложения на этом языке стало проще, чем когда-либо ранее. Эта книга знакомит программистов (любителей и профессионалов) со спецификацией ES6 наряду с некоторыми связанными с ней инструментальными средствами и методиками на сугубо практической основе.Этан Браун, автор книги Web Development with Node and Express, излагает не только простые и понятные темы (переменные, ветвление потока, массивы), но и более сложные концепции, такие как функциональное и асинхронное программирование. Вы узнаете, как создавать мощные и эффективные веб-приложения для работы на клиенте или сервере Node.js.\r\n\r\n- Используйте ES6 для транскомпиляции в переносимый код ESS;\r\n- Преобразуйте данные в формат, который может использовать JavaScript;\r\n- Усвойте основы и механику применения функций JavaScript;\r\n- Изучите объекты и объектно-ориентированное программирование;\r\n- Ознакомьтесь с новыми концепциями, такими как итераторы, генераторы и прокси-объекты;\r\n- Преодолейте сложности асинхронного программирования;\r\n- Используйте объектную модель документа для приложений, выполняемых в браузере;\r\n- Изучите основы применения платформы Node.js для разработки серверных приложений.;",
    "Price": 1258.0,
    "BookCover": null,
    "Category": {
      "Name": "Frontend"
    },
    "Publisher": {
      "Name": "Вильямс",
      "Country": null
    },
    "AverageRating": "0"
  }
]