[
  {
    "Title": "Язык программирования C# 6.0 и платформа .NET 4.6",
    "Authors": "Эндрю Троелсен, Филипп Джепикс",
    "Year": 2016,
    "Language": "русский",
    "PageCount": 1440,
    "Description": "Новое 7-е издание этой книги было полностью пересмотрено и переписано с учетом последних изменений спецификации языка C# и новых достижений платформы .NET Framework. Отдельные главы посвящены важным новым средствам, которые делают .NET Framework 4.6 самым передовым выпуском, в том числе: - Усовершенствованная модель программирования ADO.NET Entity Framework; \r\n- Многочисленные улучшения IDE - среды и архитектуры MVVM для разработки настольных приложений WPF;\r\n-Многочисленные обновления в ASP.NET Web API.\r\nПомимо этого предлагается исчерпывающее рассмотрение всех ключевых возможностей языка C#, как старых, так и новых, что позволило обрести популярность предыдущим изданиям этой книги. Читатели получат основательные знания приемов объектно-ориентированной обработки, атрибутов и рефлексии, обобщений и коллекций, а также обретут понимание многих сложных тем, которые не раскрываются в других источниках (таких как коды операций CIL и выпуск динамических сборок).\r\nОсновная миссия книги заключается в том, чтобы служить исчерпывающим руководством по языку программирования C# и ключевым аспектам платформы .NET, а также предоставлять обзорные сведения о технологиях, построенных на основе C# и .NET (ADO.NET и Entity Framework, Windows Communication Foundation (WCF), Windows Presentation Foundation (WPF) и ASP.NET (Web Forms, MVC, Web API)).\r\nБлагодаря приведенной в книге информации у читателей появится возможность применять полученные знания при решении специфичных задач программирования и готовность к дальнейшим исследованиям мира .NET.",
    "Price": 3038.00,
    "BookCover": "ProCSharp6",
    "Category": {
      "Name": "C#",
      "ParentId": 1,
      "Parent": {
        "Name": "Языки программирования",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 1
      },
      "Subcategories": null,
      "Id": 6
    },
    "CategoryId": 6,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 1
  },
  {
    "Title": "C# 6.0. Справочник. Полное описание языка",
    "Authors": "Джозеф Албахари, Бен Албахари",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 1040,
    "Description": "Данное руководство, ставшее бестселлером, позволяет получить точные ответы практически на любые вопросы по C# 6.0, CLR и основным сборкам .NET Framework. После своего появления в 2000 году C# стал языком с выдающейся гибкостью и мощью, но его постоянный рост и совершенствование означают необходимость в дополнительном изучении. Организованное по концепциям и сценариям использования, существенно обновленное 6-е издание книги предлагает программистам средней и высокой квалификации лаконичный план получения знаний по языку C# и платформе .NET Framework. Читая ее, вы очень быстро поймете, почему это руководство считают авторитетным справочником по C#.\r\nИзучите все аспекты языка C#, начиная с основ синтаксиса и переменных и заканчивая сложными темами, такими как указатели и перегрузка операций.\r\nНаучитесь пользоваться языком LINQ благодаря трем посвященным ему главам.\r\nОсвойте динамическое, асинхронное и параллельное программирование.\r\nПолучите навыки работы со средствами .NET, в числе которых XML, взаимодействие с сетью, сериализация, рефлексия, безопасность, домены приложений и контракты кода.\r\nИсследуйте новый компилятор как службу C# 6.0 под названием Roslyn. ",
    "Price": 2533.00,
    "BookCover": "CSharp6InNutshell",
    "Category": {
      "Name": "C#",
      "ParentId": 1,
      "Parent": {
        "Name": "Языки программирования",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 1
      },
      "Subcategories": null,
      "Id": 6
    },
    "CategoryId": 6,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 2
  },
  {
    "Title": "C# для профессионалов. Тонкости программирования",
    "Authors": "Джон Скит",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 608,
    "Description": "Книга C# ДЛЯ ПРОФЕССИОНАЛОВ. ТОНКОСТИ ПРОГРАММИРОВАНИЯ (C# in Depth) является обновлением предыдущего издания, ставшего бестселлером, с целью раскрытия новых средств языка C# 5, включая решение проблем, которые связаны с написанием сопровождаемого асинхронного кода. Она предлагает уникальные сведения о сложных областях и темных закоулках языка, которые может предоставить только эксперт Джон Скит. Если вы занимаетесь разработкой приложений .NET, то будете использовать C# как при построении сложного приложения уровня предприятия, так и при ускоренном написании какого-нибудь чернового приложения. В C# 5 можно делать удивительные вещи с помощью обобщений, лямбда-выражений, динамической типизации, LINQ, итераторных блоков и других средств. Однако прежде их необходимо должным образом изучить. Третье издание книги было полностью пересмотрено с целью раскрытия новых средств версии C# 5, включая тонкости написания сопровождаемого асинхронного кода. Вы увидите всю мощь языка C# в действии и научитесь работать с ценнейшими средствами, которые эффективно впишутся в применяемый набор инструментов. Кроме того, вы узнаете, как избегать скрытых ловушек при программировании на C# с помощью кристально чистых объяснений вопросов, касающихся внутреннего устройства языка. В этой книге предполагается, что вы хорошо усвоили свою первую книгу по C# и жаждете большего! Что внутри:\r\nобновления, появившиеся в C# 5;\r\nновое средство async/await;\r\nкак и почему работает C#; Об авторе Джон Скит - старший инженер по программному обеспечению в Google, а также видный участник групп новостей, групп пользователей, международных конференций и сайта Stack Overflow Q&A. Большая часть ежедневной работы Джона связана с кодированием на Java, но его сердце принадлежит C#.",
    "Price": 1920.00,
    "BookCover": "CSharpInDepth",
    "Category": {
      "Name": "C#",
      "ParentId": 1,
      "Parent": {
        "Name": "Языки программирования",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 1
      },
      "Subcategories": null,
      "Id": 6
    },
    "CategoryId": 6,
    "Publisher": {
      "Name": "Вильямс",
      "Country": null,
      "Id": 2
    },
    "PublisherId": 2,
    "AverageRating": 0,
    "Id": 3
  },
  {
    "Title": "ASP.NET Core MVC с примерами на C# для профессионалов",
    "Authors": "Адам Фримен",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 992,
    "Description": "В книге объясняется, как эффективно применять новые возможности инфраструктуры 'модель - представление - контроллер' (MVC), обновленной до версии ASP.NET Core MVC. Теперь вы сможете создавать более экономные, оптимизированные под облако и готовые к функционированию на мобильных устройствах приложения для платформы .NET. Книга предоставляет детальное описание того, как вписать новую функциональность в существующий контекст разработки. Инфраструктура ASP.NET Core MVC - это самая последняя ступень развития веб-платформы ASP.NET производства Microsoft, построенная на совершенно новом фундаменте. Она олицетворяет коренное изменение в том, как Microsoft конструирует и развертывает инфраструктуры для разработки веб-приложений, и свободна от унаследованных технологий, подобных Web Forms. Платформа ASP.NET Core MVC предлагает 'независимую от хоста' инфраструктуру и высокопродуктивную модель программирования, которая способствует построению более чистой кодовой архитектуры, разработке через тестирование и значительной расширяемости.\r\nНовое 6 - е издание этой лидирующей на рынке книги следует тому же формату и стилю подачи материала,\r\nкоторым отличались популярные предыдущие издания,\r\nно повсеместно обновлено с учетом выпуска ASP.NET Core MVC.Адам Фримен,\r\nавтор многочисленных бестселлеров,\r\nтщательно пересмотрел книгу,\r\nчтобы показать,\r\nкак извлечь максимум из ASP.NET Core MVC.\r\nОн представляет полностью работающий учебный пример функционирующего приложения ASP.NET MVC,\r\nкоторый вы сможете использовать в качестве шаблона для собственных проектов.Вы начнете с азов и постепенно доберетесь до описания более сложных средств.\r\nБлагодаря этой книге,\r\nвы освоите следующие темы:\r\n-Обретете глубокое понимание архитектуры ASP.NET Core MVC\r\n- Изучите инфраструктуру ASP.NET Core MVC как единое целое\r\n- Увидите в действии инфраструктуру MVC и разработку через тестирование\r\n- Узнаете новые возможности ASP.NET Core MVC и научитесь их эффективно применять в своей работе\r\n- Выясните,\r\nкак создавать веб - службы REST и одностраничные приложения(SPA)\r\n- Сможете воспользоваться имеющимися у вас знаниями предшествующих выпусков MVC для быстрого и эффективного освоения новой модели программирования.",
    "Price": 3546.00,
    "BookCover": "AspNetCore",
    "Category": {
      "Name": "Asp.net Core",
      "ParentId": 2,
      "Parent": {
        "Name": "Backend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 2
      },
      "Subcategories": null,
      "Id": 7
    },
    "CategoryId": 7,
    "Publisher": {
      "Name": "Вильямс",
      "Country": null,
      "Id": 2
    },
    "PublisherId": 2,
    "AverageRating": 0,
    "Id": 4
  },
  {
    "Title": "Эффективное программирование на C#. 50 способов улучшения кода",
    "Authors": "Билл Вагнер",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 224,
    "Description": "В этой книге многоуважаемый эксперт в области .NET Билл Вагнер исследует 50 способов использования в своих целях полной мощи языка C# 6.0 для написания исключительно надежного, эффективного и высокопроизводительного кода. Отражая растущую сложность языка C# и сообщества разработчиков, автор обозначает десятки новых путей написания лучшего кода. В число новых решений настоящего издания входят такие, которые задействуют преимущества обобщений, а также те, что более сконцентрированы на LINQ. Отдельная глава посвящена передовому опыту работы с исключениями. Ясное и ориентированное на практику изложение Вагнера, экспертные советы и реалистичный код делают книгу незаменимой для сотен тысяч разработчиков. Опираясь на свой непревзойденный опыт, автор рассматривает все темы, простирающиеся от управления ресурсами до поддержки многоядерных процессоров, и объясняет, каким образом избежать распространенных ловушек в языке и среде .NET. Вы узнаете, как выбирать наиболее эффективное решение, когда существует множество вариантов, и каким образом писать код, который гораздо легче сопровождать и улучшать. \r\n\r\nАвтор книги показывает, как и почему: \r\nотдавать предпочтение неявно типизированным локальным переменным (см. совет 1) \r\nзаменять вызовы string.Format() интерполированными строками (см. совет 4)\r\nвыражать обратные вызовы с помощью делегатов (см. совет 7)\r\nиспользовать наилучшим образом управление ресурсами .NET (см. совет 11)\r\nопределять минимальные и достаточные ограничения для обобщений (см. совет 18)\r\nспециализировать обобщенные алгоритмы с применением контроля типов во время выполнения (см. совет 19)\r\nиспользовать делегаты для определения ограничений методов на параметрах типов (см. совет 23)\r\nдополнять минимальные контракты интерфейсов расширяющими методами (см. совет 27)\r\nсоздавать компонуемые API-интерфейсы для последовательностей (см. совет 31)\r\nотвязывать итерации от действий, предикатов и функций (см. совет 32)\r\nотдавать предпочтение лямбда-выражениям перед методами (см. совет 38)\r\nпроводить различие между ранним и отложенным выполнением (см. совет 40)\r\nизбегать захватывания затратных ресурсов (см. совет 41)\r\nприменять исключения для сообщения о нарушениях контрактов методов (см. совет 45)\r\nзадействовать побочные эффекты в фильтрах исключений (см. совет 50) \r\nВы уже успешный программист на C#, а эта книга сделает вас выдающимся программистом.",
    "Price": 1258.00,
    "BookCover": "EffectiveCSharp",
    "Category": {
      "Name": "C#",
      "ParentId": 1,
      "Parent": {
        "Name": "Языки программирования",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 1
      },
      "Subcategories": null,
      "Id": 6
    },
    "CategoryId": 6,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 5
  },
  {
    "Title": "WPF: Windows Presentation Foundation в .NET 4.5 с примерами на C# 5.0 для профессионалов",
    "Authors": "Мэтью Макдональд",
    "Year": 2014,
    "Language": "русский",
    "PageCount": 1024,
    "Description": "Книга 'WPF: Windows Presentation Foundation в.NET 4.5 с примерами на C# 5.0 для профессионалов' представляет собой исчерпывающее авторитетное руководство по внутренней работе WPF. Благодаря серьезным примерам и практическим рекомендациям, вы изучите все, что необходимо знать для профессионального использования WPF. Книга начинается с построения прочного фундамента из элементарных концепций, подкрепленного существующими знаниями языка C#. Затем предлагается обсуждение сложных концепций с их демонстрацией на полезных примерах, которые подчеркивают получаемую экономию времени и затраченных усилий Платформа Windows Presentation Foundation (WPF) от Microsoft предоставляет инфраструктуру разработки, предназначенную для построения высококачественных пользовательских интерфейсов для операционной системы Windows. Она сочетает в себе насыщенный контент из широкого диапазона источников и позволяет получить неограниченный доступ ко всей вычислительной мощи компьютера, функционирующего под управлением Windows. В книге 'WPF: Windows Presentation Foundation в .NET 4.5 с примерами на C# 5.0 для профессионалов' подробно рассматриваются следующие темы\r\nФундаментальные основы программирования для WPF,\r\nначиная с XAML и заканчивая элементами управления и потоком данных\r\nРазработка реалистичных приложений,\r\nпозволяющих увидеть навигацию,\r\nлокализацию и развертывание в действии\r\nИсследование расширенных элементов управления пользовательского интерфейса,\r\nкоторые предлагаются WPF\r\nИзучение способов управления документами внутри WPF: компоновка текста,\r\nвывод на печать и упаковка документов\r\nИспользование графики и мультимедиа для совершенствования приложений\r\nКнига рассчитана на разработчиков,\r\nкоторые впервые сталкиваются с WPF.Опыт программирования на C# и знание базовой архитектуры .NET поможет быстрее разобраться с примерами, но все необходимые концепции кратко объясняются с самого начала.",
    "Price": 3200.00,
    "BookCover": "WPF",
    "Category": {
      "Name": "WPF",
      "ParentId": 3,
      "Parent": {
        "Name": "Desktop",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 3
      },
      "Subcategories": null,
      "Id": 8
    },
    "CategoryId": 8,
    "Publisher": {
      "Name": "Вильямс",
      "Country": null,
      "Id": 2
    },
    "PublisherId": 2,
    "AverageRating": 0,
    "Id": 6
  },
  {
    "Title": "Angular для профессионалов",
    "Authors": "Адам Фримен",
    "Year": 2018,
    "Language": "русский",
    "PageCount": 800,
    "Description": "Выжмите из Angular - ведущего фреймворка для динамических приложений JavaScript - всё. Адам Фримен начинает с описания MVC и его преимуществ, затем показывает, как эффективно использовать Angular, охватывая все этапы: начиная с основ и до самых передовых возможностей, которые кроются в глубинах этого фреймворка. Каждая тема изложена четко и лаконично, снабжена большим количеством подробностей, которые позволят стать вам действительно эффективными. Наиболее важные фичи даны без излишних подробностей, но содержат всю необходимую информацию, чтобы вы смогли обойти все подводные камни.",
    "Price": 1577.00,
    "BookCover": "Angular",
    "Category": {
      "Name": "Angular",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 9
    },
    "CategoryId": 9,
    "Publisher": {
      "Name": "Питер",
      "Country": null,
      "Id": 3
    },
    "PublisherId": 3,
    "AverageRating": 0,
    "Id": 7
  },
  {
    "Title": "Angular и TypeScript. Сайтостроение для профессионалов",
    "Authors": "Яков Файн, Антон Моисеев",
    "Year": 2018,
    "Language": "русский",
    "PageCount": 464,
    "Description": "Если вы занимаетесь веб-разработкой - от веб-клиентов до полнофункциональных одностраничных приложений - то фреймворк Angular будет для вас просто спасением. Этот ультрасовременный инструмент полностью интегрирован со статически типизированным языком TypeScript, который отлично вписывается в экосистему JavaScript.Вы научитесь:\r\nПроектировать и строить модульные приложения.\r\nПравильно транспилировать TypeScript в JavaScript.\r\nПользоваться новейшими инструментами JavaScript - в частности, npm, Karma и Webpack.\r\nЕсли вам знаком язык JavaScript - берите и читайте! Знаний TypeScript или AngularJS для изучения книги не требуется.",
    "Price": 1124.00,
    "BookCover": "AngularTS",
    "Category": {
      "Name": "Angular",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 9
    },
    "CategoryId": 9,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 8
  },
  {
    "Title": "React и Redux. Функциональная веб-разработка",
    "Authors": "Алекс Бэнкс, Ева Порселло",
    "Year": 2018,
    "Language": "русский",
    "PageCount": 336,
    "Description": "Хотите научиться писать эффективные пользовательские интерфейсы при помощи React? Тогда вы нашли нужную книгу. Авторы расскажут, как создавать пользовательские интерфейсы при помощи этой компактной библиотеки и писать сайты, на которых можно обрабатывать огромные объемы данных без перезагрузки страниц. Также вы изучите новейшие возможности стандарта ECMAScript и функционального программирования.",
    "Price": 972.00,
    "BookCover": "ReactRedux",
    "Category": {
      "Name": "React",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 10
    },
    "CategoryId": 10,
    "Publisher": {
      "Name": "Питер",
      "Country": null,
      "Id": 3
    },
    "PublisherId": 3,
    "AverageRating": 0,
    "Id": 9
  },
  {
    "Title": "ES6 и не только",
    "Authors": "Кайл Симпсон",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 336,
    "Description": "Даже если у вас уже есть опыт работы с JavaScript, скорее всего, язык вы в полной мере не знаете. Особое внимание в этой книге уделяется новым функциям, появившимся в Ecmascript 6 (ES6) - последней версии стандарта JavaScript. ES6 повествует о тонкостях языка, малознакомых большинству работающих на JavaScript программистов. Вооружившись этими знаниями, вы достигните подлинного мастерства; выучите новый синтаксис; научитесь корректно использовать итераторы, генераторы, модули и классы; сможете более эффективно работы с данными; познакомитесь с новыми API, например, Array, Object, Math, Number и String; расширите функционал программ с помощью мета-программирования.",
    "Price": 776.00,
    "BookCover": "ES6",
    "Category": {
      "Name": "JavaScript",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 11
    },
    "CategoryId": 11,
    "Publisher": {
      "Name": "Питер",
      "Country": null,
      "Id": 3
    },
    "PublisherId": 3,
    "AverageRating": 0,
    "Id": 11
  },
  {
    "Title": "Изучаем JavaScript. Руководство по созданию современных веб-сайтов",
    "Authors": "Этан Браун",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 368,
    "Description": "Сейчас самое время изучить JavaScript. После выхода последней спецификации JavaScript - ECMAScript 6.0 (ES6) - научиться создавать высококачественные приложения на этом языке стало проще, чем когда-либо ранее. Эта книга знакомит программистов (любителей и профессионалов) со спецификацией ES6 наряду с некоторыми связанными с ней инструментальными средствами и методиками на сугубо практической основе.Этан Браун, автор книги Web Development with Node and Express, излагает не только простые и понятные темы (переменные, ветвление потока, массивы), но и более сложные концепции, такие как функциональное и асинхронное программирование. Вы узнаете, как создавать мощные и эффективные веб-приложения для работы на клиенте или сервере Node.js.\r\n\r\n- Используйте ES6 для транскомпиляции в переносимый код ESS;\r\n- Преобразуйте данные в формат, который может использовать JavaScript;\r\n- Усвойте основы и механику применения функций JavaScript;\r\n- Изучите объекты и объектно-ориентированное программирование;\r\n- Ознакомьтесь с новыми концепциями, такими как итераторы, генераторы и прокси-объекты;\r\n- Преодолейте сложности асинхронного программирования;\r\n- Используйте объектную модель документа для приложений, выполняемых в браузере;\r\n- Изучите основы применения платформы Node.js для разработки серверных приложений.;",
    "Price": 1258.00,
    "BookCover": "LearningJS",
    "Category": {
      "Name": "JavaScript",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 11
    },
    "CategoryId": 11,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 12
  },
  {
    "Title": "Microsoft SQL Server 2012. Основы T-SQL",
    "Authors": "Ицик Бен-Ган",
    "Year": 2015,
    "Language": "русский",
    "PageCount": 400,
    "Description": "В книге изложены основы программирования на языке T-SQL. Вы научитесь программировать и писать запросы для Microsoft SQL Server 2012, а большое количество примеров и упражнений помогут вам начать создавать эффективный код.",
    "Price": 902.00,
    "BookCover": "MSSQL2012",
    "Category": {
      "Name": "SQL",
      "ParentId": 5,
      "Parent": {
        "Name": "Базы данных",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 5
      },
      "Subcategories": null,
      "Id": 12
    },
    "CategoryId": 12,
    "Publisher": {
      "Name": "Эксмо",
      "Country": null,
      "Id": 4
    },
    "PublisherId": 4,
    "AverageRating": 0,
    "Id": 13
  },
  {
    "Title": "Освой самостоятельно SQL за 10 минут",
    "Authors": "Бен Форта",
    "Year": 2017,
    "Language": "русский",
    "PageCount": 228,
    "Description": "В этой книге даются простые и практические ответы на вопросы, требующие быстрого решения. Проработав 30 уроков, длительностью около 10 минут каждый, вы научитесь всему, что требуется знать, чтобы выгодно пользоваться языком T-SQL для работы с РСУБД Microsoft SQL Server. Этот удобный карманный справочник начинается с простых примеров извлечения данных и постепенно переходит к более сложным вопросам, включая соединения, подзапросы, регулярные выражения и полноценный текстовый поиск, хранимые процедуры, курсоры, триггеры, табличные ограничения, обработку данных в форматах XML и JSON и многое другое.\nДля удобства изучения материала уроков книга снабжена следующими врезками.\n- Совет. Указывает краткие пути и решения практических задач.\n- Предупреждение. Помогает избежать типичных скрытых препятствий.\n- Примечание. Поясняет сопутствующие понятия и предоставляет дополнительные сведения.\n\nПотратив 10 минут на каждый урок, вы научитесь следующему.\n- Пользоваться T-SQL в средах и инструментальных средствах SQL Server.\n- Составлять сложные запросы, используя операторы, предложения и операции на T-SQL.\n- Извлекать, сортировать и форматировать содержимое базы данных.\n- Отбирать нужные данные, применяя различные способы их фильтрации.\n- Соединять вместе две таблицы и больше.\n- Внедрять глобализацию и локализацию на SQL Server.\n- Составлять подзапросы для уточнения данных.\n- Автоматизировать рабочую нагрузку с помощью триггеров.\n- Создавать и изменять таблицы базы данных.\n- Обращаться с представлениями, хранимыми процедурами, курсорами, и прочими средствами SQL Server",
    "Price": 650.00,
    "BookCover": "TSQL",
    "Category": {
      "Name": "SQL",
      "ParentId": 5,
      "Parent": {
        "Name": "Базы данных",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 5
      },
      "Subcategories": null,
      "Id": 12
    },
    "CategoryId": 12,
    "Publisher": {
      "Name": "Вильямс",
      "Country": null,
      "Id": 2
    },
    "PublisherId": 2,
    "AverageRating": 0,
    "Id": 14
  },
  {
    "Title": "Angular. Сборник рецептов",
    "Authors": "Мэтт Фрисби",
    "Year": 2018,
    "Language": "Russian",
    "PageCount": 464,
    "Description": "В каркасе Angular 2 введена совершенно новая парадигма разработки веб-приложений. В нем полностью охвачены новейшие понятия, на которых будут создаваться браузеры следующего поколения, а также исключено все лишнее из версии Angular 1. Эта книга погружает читателя в саму суть наиболее важных понятий Angular 2. Помимо самого каркаса Angular 2, в книге рассматриваются новый синтаксис стандарта ES6 языка JavaScript, особенности языка TypeScript, спецификации Web Components, наблюдаемых объектов из библиотеки RxJS и много других новых понятий. Освоить каркас Angular 2, без сомнения, нелегко, особенно тем, кто лишь начинает открывать для себя новые технологии и стандарты. В этой книге рассматриваются самые сложные понятия Angular 2 и в то же время демонстрируются самые передовые нормы практики, помогающие овладеть эффективными инструментальными средствами данного каркаса. Кроме того, в ней поясняются методы и принципы, ускоряющие написание веб-приложений, а также часто пренебрегаемые вопросы тестирования и производительности. Эта книга позволит читателям досконально усвоить особенности каркаса Angular 2.",
    "Price": 1039.00,
    "BookCover": "AngularRecipes",
    "Category": {
      "Name": "Angular",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 9
    },
    "CategoryId": 9,
    "Publisher": {
      "Name": "Вильямс",
      "Country": null,
      "Id": 2
    },
    "PublisherId": 2,
    "AverageRating": 0,
    "Id": 15
  },
  {
    "Title": "C# 7.0. Карманный справочник",
    "Authors": "Джозеф Албахари, Бен Албахари",
    "Year": 2018,
    "Language": "Russian",
    "PageCount": 224,
    "Description": "Когда вам нужны ответы на вопросы по программированию на языке C# 7.0, этот узкоспециализированный справочник предложит именно то, что необходимо знать - безо всяких длинных введений или раздутых примеров. Легкое в чтении и идеальное в качестве краткого справочника, данное руководство поможет опытным программистам на C#, Java и C++ быстро ознакомиться с последней версией языка C#. Все программы и фрагменты кода, рассмотренные в книге, доступны как интерактивные примеры в LINQPad. Вы можете их редактировать и немедленно видеть результаты без необходимости в подготовке проектов в Visual Studio. Эта книга написана авторами книги C# 7.0. Справочник. Полное описание языка (C# 7.0 in a Nutshell) и раскрывает все особенности языка C# 7.0.\nФундаментальные основы C#\n•Новые средства C# 7.0, включая кортежи, сопоставление по шаблону и деконструкторы\n•Более сложные темы: перегрузка операций, ограничения типов, итераторы, типы, допускающие null, подъем операций, лямбда-выражения и замыкания\n•Язык LINQ: последовательности, отложенное выполнение, стандартные операции запросов и выражения запросов\n•Небезопасный код и указатели, специальные атрибуты, директивы препроцессора и XML-документация",
    "Price": 659.00,
    "BookCover": "CSharp7InNutshellmini",
    "Category": {
      "Name": "C#",
      "ParentId": 1,
      "Parent": {
        "Name": "Языки программирования",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 1
      },
      "Subcategories": null,
      "Id": 6
    },
    "CategoryId": 6,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 16
  },
  {
    "Title": "C# 7.0. Справочник. Полное описание языка",
    "Authors": "Бен Албахари, Джозеф Албахари",
    "Year": 2018,
    "Language": "Russian",
    "PageCount": 1024,
    "Description": "Когда у вас возникают вопросы по языку C# 7.0 или среде CLR и основным сборкам .NET Framework, это ставшее бестселлером руководство предложит все необходимые ответы. С момента представления в 2000 году C# стал языком с замечательной гибкостью и широким размахом, но такое непрекращающееся развитие означает, что по-прежнему есть многие вещи, которые предстоит изучить. \nОрганизованное вокруг концепций и сценариев использования, основательно обновленное седьмое издание книги снабдит программистов средней и высокой квалификации лаконичным планом получения знаний по C# и .NET. Погрузитесь в него и выясните, почему данное руководство считается исчерпывающим справочником по языку C#.",
    "Price": 2339.00,
    "BookCover": "CSharp7InNutshell",
    "Category": {
      "Name": "C#",
      "ParentId": 1,
      "Parent": {
        "Name": "Языки программирования",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 1
      },
      "Subcategories": null,
      "Id": 6
    },
    "CategoryId": 6,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 17
  },
  {
    "Title": "Front-end. Клиентская разработка для профессионалов. Node.js, ES6, REST",
    "Authors": "Крис Аквино, Тодд Ганди",
    "Year": 2018,
    "Language": "Russian",
    "PageCount": 512,
    "Description": "В книге \"Front-end. Клиентская разработка для профессионалов\" рассмотрены все важнейшие навыки работы с JavaScript, HTML5 и CSS3, требуемые серьезному разработчику, чтобы преуспеть в создании современного клиентского кода. Читатель быстро освоится с новыми инструментами и технологиями, с проверенными практиками, которые актуальны уже сегодня. В каждой главе рассматриваются важнейшие концепции и API, неотделимые от качественной веб-разработки, тщательно проверенные и отточенные в процессе решения реальных практических задач.",
    "Price": 1089.00,
    "BookCover": "Frontend",
    "Category": {
      "Name": "JavaScript",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 11
    },
    "CategoryId": 11,
    "Publisher": {
      "Name": "Питер",
      "Country": null,
      "Id": 3
    },
    "PublisherId": 3,
    "AverageRating": 0,
    "Id": 18
  },
  {
    "Title": "JavaScript и jQuery. Исчерпывающее руководство",
    "Authors": "Дэвид Сойер Макфарланд",
    "Year": 2017,
    "Language": "Russian",
    "PageCount": 880,
    "Description": "JavaScript - основной инструмент веб-разработчиков, позволяющий делать интернет-страницы интерактивными. Перед вами - наиболее полное и великолепно структурированное руководство по JavaScript, которое позволит в совершенстве овладеть этим востребованным сейчас языком программирования. В книге уделено большое внимание библиотеке jQuery, в том числе самого современного плагина jQuery UI.",
    "Price": 1039.00,
    "BookCover": "JavascriptAndJQuery",
    "Category": {
      "Name": "JavaScript",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 11
    },
    "CategoryId": 11,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 19
  },
  {
    "Title": "Секреты JavaScript ниндзя",
    "Authors": "Джон Резиг, Беэр Бибо, Иосип Марас",
    "Year": 2018,
    "Language": "Russaian",
    "PageCount": 544,
    "Description": "Язык JavaScript быстро становится универсальным для разработки различных типов приложений, будь то для веб, облака, настольных систем или мобильных устройств. Стать профессиональным разработчиком приложений на JavaScript - означает, приобрести ряд эффективных навыков, которые могут пригодиться во всех этих предметных областях. Во втором издании данной книги на многих практических примерах ясно демонстрируется каждое основное понятие или методика. Это издание было полностью переработано с целью показать, как овладеть такими понятиями JavaScript, как функции, замыкания, объекты, прототипы и обещания. В нем рассматриваются и такие понятия, как модель DOM, события и таймеры, а также нормы передовой практики программирования, в том числе тестирование и разработка кросс-браузерного кода. И все это подается с позиции опытных практикующих специалистов по JavaScript, которыми являются авторы книги.\nОсновные темы книги\n•Написание более эффективного кода с помощью функций, объектов и замыканий.\n•Преодоление скрытых препятствий, которые таит в себе разработка веб-приложений на JavaScript.\n•Применение регулярных выражений для написания лаконичного кода, предназначенного для обработки текста.\n•Управление асинхронным кодом с помощью обещаний.\n•Рассмотрение языковых средств, внедренных в стандарты ES6 и ES7 языка JavaScript.\n\nДля чтения этой книги совсем не обязательно быть профессиональным программистом на JavaScript.\nНужно лишь иметь желание стать им. И если вы готовы стать мастером своего дела, то книга окажет вам в этом всяческую помощь.",
    "Price": 2249.00,
    "BookCover": "JSNinja",
    "Category": {
      "Name": "JavaScript",
      "ParentId": 4,
      "Parent": {
        "Name": "Frontend",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 4
      },
      "Subcategories": null,
      "Id": 11
    },
    "CategoryId": 11,
    "Publisher": {
      "Name": "Диалектика",
      "Country": null,
      "Id": 1
    },
    "PublisherId": 1,
    "AverageRating": 0,
    "Id": 20
  },
  {
    "Title": "SQL. Полное руководство",
    "Authors": "Джеймс Р. Грофф, Пол Н. Вайнберг, Эндрю Дж. Оппель",
    "Year": 2014,
    "Language": "Russain",
    "PageCount": 960,
    "Description": "Эта книга расскажет вам, как работать с командами и инструкциями SQL, создавать и настраивать реляционные базы данных, загружать и модифицировать объекты баз данных, выполнять мощные запросы, повышать производительность и выстраивать систему безопасности. Вы узнаете, как использовать инструкции DDL и применять API, интегрировать XML и сценарии Java, использовать объекты SQL, создавать веб-серверы, работать с удаленным доступом и выполнять распределенные транзакции. В этой книге вы найдете такие сведения, как описанияработы с базами данных в памяти, потоковыми и встраиваемыми базами данных, базами данных для мобильных и наладонных устройств, и многое другое.\nПрочитав ее вы узнаете:\nПостроение SQL-реляционных баз данных и приложений, создание, загрузка и модификация объектов баз данных с применением SQL;\nПостроение и выполнение простых, многотабличных и суммирующих запросов;\nРеализация системы безопасности с использованием аутентификации, привилегий, ролей и представлений;\nОптимизация, резервное копирование, восстановление и репликация баз данных;\nРабота с хранимыми процедурами, функциями, расширениями, триггерами и объектами;\nРасширенная функциональность с применением API, динамического и встраиваемого SQL;\nОписание таких вопросов, как транзакции, механизмы блокировок, материализованные представления и протокол двухфазного завершения транзакции;\nПоследние тенденции рынка и будущее SQL.\nДанная книга включает полное описание синтаксиса соединений SQL!\nПолное описание возможностей SQL, стандарта ANSI, вопросов применения и программирования.\nВключает историю, рыночные тенденции и сравнение возможностей ведущих СУБД.\nОбновленная информация о XML, корпоративных и специализированных базах данных (базы данных в памяти, потоковые и встраиваемые базы данных).\nМатериал от трех ведущих экспертов охватывает все аспекты SQL. Пересмотренное с учетом последних версий РСУБД, это руководство поясняет, как создавать, наполнять и администрировать высокопроизводительные базы данных и разрабатывать мощные и надежныеприложения с использованием SQL. \n\nОб авторах\nДжеймс Р. Грофф является исполнительным директором компании PBworks. Ранее Грофф занимал ту же должность в компании TimesTen, возглавляя ее в течение восьми лет до покупки компании в 2005 году корпорацией Oracle.\nПоль Н. Вайнберг - старший вице-президент компании SAP. Вайнберг - эксперт в области SQL; его компания A2i, Inc. была приобретена SAP в 2004 году. Вместе с Дж. Гроффом является соавтором предыдущих изданий этой книги.\nЭндрю Дж. Оппель - ведущий специалист по моделированию данных в Blue Shield. Кроме того, он уже более 20 лет преподает теорию баз данных в Калифорнийском университете в Беркли.",
    "Price": 2539.00,
    "BookCover": "SQLFullGuide",
    "Category": {
      "Name": "SQL",
      "ParentId": 5,
      "Parent": {
        "Name": "Базы данных",
        "ParentId": null,
        "Parent": null,
        "Subcategories": null,
        "Id": 5
      },
      "Subcategories": null,
      "Id": 12
    },
    "CategoryId": 12,
    "Publisher": {
      "Name": "Вильямс",
      "Country": null,
      "Id": 2
    },
    "PublisherId": 2,
    "AverageRating": 0,
    "Id": 21
  }
]